app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("title", "content", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "This is my answer"], ["content", "I'm not answering the question"], ["question_id", 1], ["created_at", "2015-01-15 00:43:04.974257"], ["updated_at", "2015-01-15 00:43:04.974257"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "answers" SET "votes" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["votes", 1], ["updated_at", "2015-01-15 01:45:36.107532"], ["id", 1]]
---
  def upvote
    @answer = Answer.find(params[:id])
    @answer.update_attributes(votes: @answer.votes + 1)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "answers" SET "votes" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["votes", 5], ["updated_at", "2015-01-15 01:54:16.540778"], ["id", 1]]
---
  def downvote
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:id])
    @answer.update_attributes(votes: @answer.votes - 1)