app/controllers/questions_controller.rb

  def index
    @quote = ApplicationHelper.githubapi
    @question = Question.new
    @questions = Question.order("votes DESC").all
---
SELECT "questions".* FROM "questions"  ORDER BY votes DESC

  def create
    @question = Question.new(question_params)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "I can't even....."], ["content", "How do I rails?"], ["created_at", "2015-01-13 00:56:39.673992"], ["updated_at", "2015-01-13 00:56:39.673992"]]

  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "change title"], ["content", "change content"], ["updated_at", "2015-01-14 18:40:57.084952"], ["id", 128]]

  def upvote
    @question = Question.find(params[:id])
    @question.update_attributes(votes: @question.votes + 1)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "votes" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["votes", 1], ["updated_at", "2015-01-15 00:20:04.537323"], ["id", 1]]

  def downvote
    @question = Question.find(params[:id])
    @question.update_attributes(votes: @question.votes - 1)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "votes" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["votes", 23], ["updated_at", "2015-01-15 00:37:07.016871"], ["id", 1]]